import React, { Component } from 'react'

export class AboutUs extends Component {
  render() {
    return (
      <>
              <div class="setingcontant">
            <div class="userpost-scroll-seting" id="style-1">
        <div class="abt-set">

            <h1>سياسة الخصوصية</h1>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو<br/> العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
</p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            <p></p>
            


</div>
        </div>
        </div>
      </>
    )
  }
}

export default AboutUs
