import { useState } from "react";
function TackeDate(props) {
  const [selcted, setselcted] = useState(1);
  return (
    <>
      <div class="request-alert">
        <span class="top-alert"></span>
        <h1>فلترة</h1>
        <div class="pric-reqNew">
          <h1>الحالة</h1>
          <ul>
            <li
              id={selcted == 1 ? "pric-reqNewLI" : ""}
              onClick={(e) => setselcted(1)}
            >
              جديد
            </li>
            <li
              id={selcted == 2 ? "pric-reqNewLI" : ""}
              onClick={(e) => setselcted(2)}
            >
              مجدولة
            </li>
          </ul>
          <br />
          <ul>
            <li
              id={selcted == 3 ? "pric-reqNewLI" : ""}
              onClick={(e) => setselcted(3)}
            >
              مكتمل
            </li>
            <li
              id={selcted == 4 ? "pric-reqNewLI" : ""}
              onClick={(e) => setselcted(4)}
            >
              مرفوض
            </li>
          </ul>
        </div>
        <br />
        <div class="pric-reqNew">
          <h1>التاريخ</h1>
          <span>
          <p>21/06/2022</p>

            <svg
              xmlns="http://www.w3.org/2000/svg"

              viewBox="0 0 39 44"
            >
              <g id="Calendar" transform="translate(0.326 -0.191)">
                <path
                  id="Calendar-2"
                  data-name="Calendar"
                  d="M11.043,44a11.046,11.046,0,0,1-8.071-2.978A11.38,11.38,0,0,1,0,32.789V14.268A11.1,11.1,0,0,1,2.972,6.16a10.712,10.712,0,0,1,6.96-2.89V1.535a1.5,1.5,0,0,1,2.985-.208l.014.208v1.7H26.087v-1.7a1.5,1.5,0,0,1,2.987-.208l.014.208V3.27a10.647,10.647,0,0,1,7.039,2.967A11.106,11.106,0,0,1,39,14.268V32.944a11.132,11.132,0,0,1-2.968,8.122A11.136,11.136,0,0,1,27.957,44ZM3,32.789c0,5.251,2.857,8.142,8.044,8.142H27.957C33.142,40.931,36,38.1,36,32.944V18.222H3ZM36,15.153v-.889A8.017,8.017,0,0,0,34,8.4a7.52,7.52,0,0,0-4.914-2.058V8.271a1.5,1.5,0,0,1-2.987.208l-.014-.208V6.3H12.93v1.97a1.5,1.5,0,0,1-2.985.208l-.014-.208V6.347C5.449,6.731,3,9.51,3,14.268v.885ZM26.885,32.635a1.522,1.522,0,0,1,1.3-1.521l.22-.014a1.537,1.537,0,0,1,.2,3.055l-.2.014A1.521,1.521,0,0,1,26.885,32.635Zm-8.876,0a1.523,1.523,0,0,1,1.3-1.521l.222-.014a1.537,1.537,0,0,1,.2,3.055l-.2.014A1.522,1.522,0,0,1,18.008,32.635Zm-8.892,0a1.522,1.522,0,0,1,1.3-1.521l.22-.014a1.537,1.537,0,0,1,.2,3.055l-.222.014A1.517,1.517,0,0,1,9.116,32.635Zm17.768-7.954a1.522,1.522,0,0,1,1.3-1.521l.22-.014a1.537,1.537,0,0,1,.2,3.055l-.2.014A1.521,1.521,0,0,1,26.885,24.681Zm-8.876,0a1.523,1.523,0,0,1,1.3-1.521l.222-.014a1.537,1.537,0,0,1,.2,3.055l-.2.014A1.522,1.522,0,0,1,18.008,24.681Zm-8.892,0a1.522,1.522,0,0,1,1.3-1.521l.22-.014a1.537,1.537,0,0,1,.2,3.055l-.222.014A1.517,1.517,0,0,1,9.116,24.681Z"
                  transform="translate(-0.326 0.191)"
                  fill="#626262"
                />
              </g>
            </svg>
          </span>
        </div>
        <button class="alert-acs-rq"> فلترة</button>
      </div>
      <div className="alert" onClick={(e) => props.off(false)}></div>
    </>
  );
}
export default TackeDate;
